'''
Виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана
користувачем).
Дужак Андрій,122-Г
'''
import numpy as np
while True:
 n,p=int(input('Введiт кількість рядків:  ')),int(input('Введіть кількість стовбців: '))#вводимо розмірність матриці
 while n !=3 and p !=3:#перевірка на розмірність 3 на 3
    n,p=int(input('Введите кількість рядкiв:  ')),int(input('Введiт кількість стовбців: '))
 a=np.zeros((n,p),dtype=int)#ініціалізуємо матрицю нулями і тип даних інт
 for i in range(n):#проходимося по рядам
    for j in range(p):#проходимся по стовбцям
        a[j,i]=int(input(f'A[{i+1},{j+1}]='))#заповнюємо матрицю значеннями,і транспонтуємо її
 print('Транспортована матриця',a)
